Исходя из данных рекомендаций нахожу у себя большое количество "магических чисел"

  01. в цикле имелось условие
  (village.charAt(indexChar) >= 48 && village.charAt(indexChar) <= 57)  
  числа 48 и 57 являлись границами для проверки принадлежит ли символ в строке числом
  обозначаю их константами
  NUMBER_ZERO_IN_ASCII = 48;
  NUMBER_NINE_IN_ASCII = 57;
  
  02. в условии
    if (countWalkers != 3)
    3 обозначало  "ровно три Ходока", при котором выполнялось условие их обнаружения
    FINDED_WHITE_WALKERS = 3;
    
  03. в условии
    if (village.length() < 5)
    5 обозначало минимальную длину строки, при которой условие могло бы иметь true результат
    MIN_LENGHT_OF_STRING_FOR_MAYBE_TRUE = 5;
    
  04. также изпользовалось в условии цифра 61 как поиск белого ходока, который в тексте был равен символу "="
    SYMBOL_WHITE_WALKERS_IN_ASCII = 61;
    
  05. В решении задачи "Лапоть" использовались "магические цифры" для определения комманд.
    Лучше было их обозначить константами для определения вида операции, например, вместо 2
    COMMAND_DELETE = 2;
      
  06.
      

    
  07.


    
  08.


    
  09.


    
  10.


    
  11. 

    
  12. 
