Исходя из данных рекомендаций нахожу у себя большое количество "магических чисел"

  01. В цикле имелось условие
  (village.charAt(indexChar) >= 48 && village.charAt(indexChar) <= 57)  
  числа 48 и 57 являлись границами для проверки принадлежит ли символ в строке числом
  обозначаю их константами
  NUMBER_ZERO_IN_ASCII = 48;
  NUMBER_NINE_IN_ASCII = 57;
  
  02. В условии
    if (countWalkers != 3)
    3 обозначало  "ровно три Ходока", при котором выполнялось условие их обнаружения
    FINDED_WHITE_WALKERS = 3;
    
  03. В условии
    if (village.length() < 5)
    5 обозначало минимальную длину строки, при которой условие могло бы иметь true результат
    MIN_LENGHT_OF_STRING_FOR_MAYBE_TRUE = 5;
    
  04. Также изпользовалось в условии цифра 61 как поиск белого ходока, который в тексте был равен символу "="
    SYMBOL_WHITE_WALKERS_IN_ASCII = 61;
    
  05. В решении задачи "Лапоть" использовались "магические цифры" для определения комманд.
    Лучше было их обозначить константами для определения вида операции, например, вместо 2
    COMMAND_DELETE = 2;

      В задаче про НЛО вместо цифрового обозначения системы счисления 8 и 16 целесообразнее прописать их имена, возможно:
  06. IN_HEXADECIMAL_SYSTEM_OF_CALCULATION = 16;  
  07. IN_OCTAL_SYSTEM_OF_CALCULATION = 8;

  08. Также часто встречаются изменяемые параметры, которые также можно было бы определить через константы
      например вместо длины массива 10, можно определить LENGHT_OF_ARRAY = 10;
      
  09. В циклах встречаются "магические цифры" i < 10/100/1000 и т.д.
      тогда можно определить их как USER_COUNT_OF_CIRCLE
    
  10. Вместо цифры 110 в качестве цены одежды в магазине можно определить
      PRICE_OF_CLOTHES_IN_SHOP = 110;
    
  11. Вместо простого определения размера шрифта цифрой 12
      FONT_SIZE_OF_TEXT = 12;
    
  12. И например, в конвертации рублей в доллары вместо 80
      CONVERSION_ROUBLES_IN_DOLLAR = 80;
