01. магическая строка "bmp" в константу
    IMAGE_FOMAT = "bmp";
  
02. изменение точности с 10.1f на 10.1d
  
03. проверка при делении в выражении speed_km = passedWay/time
    if (time > 0)
  
04. изменение числа 20.0 на 20, т.к. можно в задаче обойтись целыми числами
  
05. изменение сравнения 1000.0d > 50 на 1000.0d > 50.0 
  
06. вместо магической строки "txt" определяем в константу
    FILE_FOMAT = ".txt";

07. изменение точности с 3.0004f на 3.0004d

08. при возведении в степень методом exponential(){FirstArgument.pow(SecondArgument)} лучше проверить не будет ли число выходить за границы int
    или использовать класс bigDecimal

09. 
  
  10.
  11.
  12.
