Все комментарии на данный момент это больше пояснения к коду, так называемые информативные комментарии.
Из других возможных сделал и нашёл следующие
1.Комментарии TODO
  //TODO - возможно использование данного метода как альтернативного. Продумать какой будет граммотнее в использовании  
2.Представление намерений
  //проба запустить парралельные потоки
3.Предупреждения о последствиях
  //ошибка в повторениях. требуется перепроверить алгоритм вычислений
4. Прояснение
  //Метод решения через Stream API
  
   Сами информативные комментарии:
5.//Чтение параметров и запуск метода по считыванию размеров поля
6.//Проверка на число введённое в консоль
7.//Функция проверки диапазона считанного числа с консоли в ограничениях от 3 до 10
8.//Копирование актуальных размеров поля-декора для текущей(запущенной в данном цикле) игры
9.//Проверка заданных координат с размерами поля, заданными в текущей игре через декор-поле
10.//Проверка, были ли уже заданные данные координаты
11.//Проверка на окончание игры "три в ряд" вызовом нескольких методов.
12.//Механика игры
